  # High-resolution OBB detector with P1/P2 heads and stride-1 early fusion
  nc: 3  # number of classes
  scales:
    s: [0.5, 0.50, 2048]  # s-scale (depth, width, max channels)
    m: [0.50, 1.00, 512]
    l: [1.00, 1.00, 512]
    x: [1.00, 1.50, 512]

  # Backbone
  backbone:
    # [from, repeats, module, args]
    - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2 (stride lowered)
    - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
    - [-1, 2, C3k2, [256, False, 0.25]] 
    - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
    - [-1, 2, C3k2, [512, False, 0.25]]
    - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
    - [-1, 6, A2C2f, [512, True, 4]]
    - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32 (will not be used in head)
    - [-1, 6, A2C2f, [1024, True, 1]] #8

  # Head
  head:
    # P4 branch
    - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # upsample P5->P4 9
    - [[-1, 6], 1, Concat, [1]]                   # concat with backbone P4 10
    - [-1, 2, A2C2f, [512, False, -1]]           # P4 head 11

    # P3 branch
    - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # upsample P4->P3 12
    - [[-1, 4], 1, Concat, [1]]                   # concat with backbone P3 13
    - [-1, 2, A2C2f, [256, False, -1]]           # P3 head 14

    # P2 branch
    - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # upsample P3->P2 15
    - [[-1, 2], 1, Concat, [1]]                   # concat with backbone P2 16
    - [-1, 2, A2C2f, [128, False, -1]]           # P2 head 17

    # P1 branch
    - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # upsample P2->P1 18
    - [[-1, 0], 1, Concat, [1]]                   # concat with backbone P1 19
    - [-1, 2, A2C2f, [128, False, -1]]            # P1 head 20

    # Optional downward paths to merge back (P1->P2->P3->P4)
    - [-1, 1, Conv, [128, 3, 2]]                  # P1 down->P2 21
    - [[-1, 17], 1, Concat, [1]]                  # concat down(P1) with P2 head 22
    - [-1, 2, A2C2f, [128, False, -1]]           # merged P2 23

    - [-1, 1, Conv, [256, 3, 2]]                  # P2 down->P3 24
    - [[-1, 14], 1, Concat, [1]]                  # concat down(P2) with P3 head 25
    - [-1, 2, A2C2f, [256, False, -1]]           # merged P3 26

    - [-1, 1, Conv, [512, 3, 2]]                  # P3 down->P4 27
    - [[-1, 11], 1, Concat, [1]]                  # concat down(P3) with P4 head 28
    - [-1, 2, A2C2f, [512, False, -1]]           # merged P4 29

    # OBB detection on P1,P2,P3,P4
    - [[20, 23, 26, 29], 1, OBB, [nc, 1]]
